In [4]:
#import pandas library
import pandas as pd

#make an array
array = [3, 6, 9, 12, 15, 18]

#create a series
series_obj = pd.Series(array)

#convert series object into array
arr = series_obj.values

arr

array([ 3,  6,  9, 12, 15, 18])

In [5]:
#reshaping series
reshaped_arr = arr.reshape((3,2))

#show
reshaped_arr

array([[ 3,  6],
       [ 9, 12],
       [15, 18]])

In [6]:
#import pandas library
import pandas as pd

#make an array
array = ["Nilay", "Dinesh", "Sachin", "Prachi", "Onya", "Sonali"]

#create a series
series_obj = pd.Series(array)

print("Given Series:\n", series_obj)

#convert series object into array
arr = series_obj.values

arr

Given Series:
 0     Nilay
1    Dinesh
2    Sachin
3    Prachi
4      Onya
5    Sonali
dtype: object

array(['Nilay', 'Dinesh', 'Sachin', 'Prachi', 'Onya', 'Sonali'],
      dtype=object)

In [10]:
#reshaping series
reshaped_arr = arr.reshape((3,2))

#show
print("After Reshaping: \n", reshaped_arr)

After Reshaping:
 [['Nilay' 'Dinesh']
 ['Sachin' 'Prachi']
 ['Onya' 'Sonali']]

In [12]:
#create a simple DataFrame

#importing pandas as pd
import pandas as pd

#creating a dataframe
df = pd.DataFrame({'Name': ['Nilay', 'Sachin', 'Dinesh', 'Onya', 'Prachi', 'Sonali'],
                   'Qualification': ['Masters', 'Masters', 'Graduate', 'Masters', 'Graduate', 'Masters'],
                   'Age': [25, 27, 30, 21, 22, 20]})

df

     Name Qualification  Age
0   Nilay       Masters   25
1  Sachin       Masters   27
2  Dinesh      Graduate   30
3    Onya       Masters   21
4  Prachi      Graduate   22
5  Sonali       Masters   20

In [15]:
#values can be an object or a list
df.pivot(index='Name', columns='Qualification', values= ['Age', 'Name'])

                   Age             Name
Qualification Graduate Masters Graduate Masters
Name
Dinesh              30     NaN   Dinesh     NaN
Nilay              NaN      25      NaN   Nilay
Onya               NaN      21      NaN    Onya
Prachi              22     NaN   Prachi     NaN
Sachin             NaN      27      NaN  Sachin
Sonali             NaN      20      NaN  Sonali

In [17]:
#the pivot table has been created for the given dataset where the gender, percentage
#has been calculated

#importing pandas
import pandas as pd

#creating dataframe
df = pd.DataFrame({'Name': ['Nilay', 'Dinesh', 'Sachin', 'Onya', 'Sonali', 'Prachi', 'Anushka'],
                   'Gender': ['Male', 'Male', 'Male', 'Female', 'Female', 'Female', 'Female'],
                   'Age': [25, 25, 27, 20, 21, 22, 23]})

print("Dataset")
print(df)
print("-"*40)

#categorizing in age groups
def age_bucket(age):
    if age <= 22:
        return "<22"
    else:
        return ">22"

Dataset
      Name  Gender  Age
0    Nilay    Male   25
1   Dinesh    Male   25
2   Sachin    Male   27
3     Onya  Female   20
4   Sonali  Female   21
5   Prachi  Female   22
6  Anushka  Female   23
----------------------------------------

In [27]:
# Assuming you have defined the age_bucket function somewhere above
df['Age Group'] = df['Age'].apply(age_bucket)

# Calculating gender percentage
gender = pd.DataFrame(df.Gender.value_counts(normalize=True) * 100).reset_index()
gender.columns = ['Gender', '%Gender']
df = pd.merge(left=df, right=gender, how='inner', on=['Gender'], suffixes=('', '_gender'))

# Creating pivot table with MultiIndex
table = pd.pivot_table(df, index=['Gender', 'Age Group'], values=['Name'], aggfunc={'Name': 'count'})

# Displaying the table
print("Table")
print(table)

Table
                  Name
Gender Age Group
Female <22           3
       >22           1
Male   >22           3